Tekla Open API Reference for Tekla Structures 2025
TextAttributes Properties
The Text.TextAttributes type exposes the following members.
Properties
Name | Description
Alignment
 The text object's alignment (left, center, right).
Angle
 The angle of the text frame.
ArrowHead
 The arrowhead of the leader line.
CustomPresentation
 Custom presentation GUID to be applied to the object type
Font
 The text object's font settings.
Frame
 The frame for the text.
PlacingAttributes
 The placing attributes that the object should use. Using these you can specify whether the object is automatically arranged in the drawing or not.
PreferredPlacing
 The type of placing the object should use. See the preferred placing types for different types of placing.
RulerWidth
 Gets or sets the width in paper coordinates of the ruler to be used in word wrapping.
TransparentBackground
 Gets or sets a value indicating whether the background transparency is enabled for texts.
UseWordWrapping
 Gets or sets a value indicating whether to [use word wrapping].
Top
See Also
Reference
Text.TextAttributes Class
Tekla.Structures.Drawing Namespace